{
  "books": [
    {
      "title": "Steve Jobs",
      "author": "Walter Isaacson",
      "genre": "Biography",
      "synopsis": "Steve Jobs by Walter Isaacson is a biography that provides an in-depth and comprehensive look at the life of Steve Jobs, the co-founder of Apple Inc. The book, published in 2011, is based on numerous interviews with Jobs, as well as interviews with his family, friends, colleagues, and competitors. It also draws upon Isaacson's extensive research and access to Jobs himself.\n\nThe biography is structured chronologically, covering Jobs' life from his adoption as a child to his untimely death in 2011. It explores Jobs' early years, his co-founding of Apple in the famous garage with Steve Wozniak, the development and success of groundbreaking products like the Macintosh, iPod, iPhone, and iPad, as well as his tumultuous relationships with colleagues, family, and friends.\n\nIsaacson's portrayal of Jobs is both candid and revealing, capturing the complexities and contradictions of the tech visionary. Jobs is depicted as a genius with a relentless pursuit of perfection, an innovative leader with a notorious intensity, and a person whose uncompromising nature had both positive and negative impacts on his life and the lives of those around him.\n\nThe biography also delves into Jobs' departures from Apple, his involvement with other ventures such as Pixar and NeXT, and his eventual return to Apple, leading to the company's resurgence and success in the 2000s.\n\nOverall, \"Steve Jobs\" by Walter Isaacson provides readers with a deep understanding of the man behind Apple and his role in revolutionizing the technology industry. The narrative not only explores Jobs' professional achievements but also examines his personal life, shedding light on his character, motivations, and the legacy he left behind."
    },
    {
      "title": "Harry Potter and the Prisoner of Azkaban",
      "author": "J.K Rowling",
      "genre": "Fantasy",
      "synopsis": "Harry started his third year at Hogwarts on a less than pleasant note. Carelessly, he bewitched Aunt Marge and then fled. On his journey, he read news about the escape of a dangerous prisoner, Sirius Black, rumored to be out to kill him. Mr. Weasley then asked him to make a peculiar promise that no matter what he heard, he wouldn't go looking for Black. Confused, Harry agreed. On the way back to school, Harry encountered Dementors, soul-sucking creatures, patrolling around Hogwarts as protection against Black. The Dementors had a much stronger impact on Harry compared to other Hogwarts students due to his dark childhood. Every time they approached, Harry would collapse. Professor Lupin, the new Defense Against the Dark Arts teacher, then taught him the Patronus charm, the only spell that could be used to fend off Dementors. The third school year began, and they delved into their tasks. Amidst it all, Ron and Hermione got into a small quarrel over the behavior of their pets. Hermione took an excessive number of classes, leaving her friends puzzled about how she managed them all. In the midst of her busy schedule, Hermione's cat, Crookshanks, repeatedly tried to eat Ron's rat, Scabbers, leading the two friends into continuous arguments about their pets. Their debate came to a halt when they discovered Scabbers' tail sticking out of Crookshanks' mouth, breaking Ron's heart. Harry received a call from Black when he secretly entered the castle. Toward the end of the year, a series of consecutive events unfolded for Harry and his friends. Ron's rat, Scabbers, turned out to be alive and, in fact, a disguised wizard, Peter Pettigrew, who was thought to be dead. Harry then also learned that the one who betrayed his parents was not Sirius Black, but Peter. Unfortunately, Peter managed to escape into the darkness of the night, evading punishment for his crimes."
    },
    {
      "title": "Harry Potter And The Chamber Of Secrets",
      "author": "Rowling J.K",
      "genre": "Fantasy",
      "synopsis": "In the second book of this series, Harry Potter once again endures the summer holidays with the annoying Dursley family. However, suddenly, a strange and magical creature named Dobby appears. Dobby is a type of house-elf who serves a specific household. Dobby warns Harry Potter not to return to Hogwarts, claiming that a catastrophe that could endanger Harry's safety at Hogwarts will occur.Despite Dobby's admonition, Harry ignores it and still returns to the Hogwarts School of Witchcraft and Wizardry. Unbeknownst to Harry, several peculiarities occur before the predicted catastrophe unfolds. He cannot pass through Platform 9¾'s barrier and is forced to travel to Hogwarts in the flying car owned by the Weasley family, along with Ronald Weasley.Other peculiarities occur until the catastrophe finally strikes. Someone is turning students into stone. From the first incident, it is revealed that the heir of Salazar Slytherin has returned to Hogwarts. This heir has reopened the Chamber of Secrets, whose existence was unknown to anyone. Who is this person? Harry and his friends suspect that the culprit is Draco Malfoy. How could he not be suspected? He sees himself as the most deserving to learn magic because he is pure-blooded. However, suspicions about the perpetrator also lead to Harry himself because it is known that Harry is a Parselmouth, someone who can speak the language of snakes. After conducting an investigation with the help of Moaning Myrtle, a ghost in the women's bathroom, Harry discovers the location of the Chamber of Secrets, which happens to be in the bathroom where Moaning Myrtle often resides. Harry finds a snake-like creature named the Basilisk inside. He also encounters a manifestation of Lord Voldemort accompanied by his Horcrux."
    },
    {
      "title": "B.J HABIBIE SI JENIUS : SEHIMPUN CERITA, CITA, DAN KARYA",
      "author": "Situmorang, Jonar T.H",
      "genre": "Biography",
      "synopsis": "The non-fiction book titled B.J. Habibie: The Genius is a work by Jonar T.H. Situmorang, M.A. This book itself is a biography that chronicles the life of the third president of the Republic of Indonesia, who is also considered the most brilliant individual in Indonesia. He became the first person to successfully create an airplane, bringing pride to the Indonesian nation. This intrigued me to explore the contents of the book, especially since Habibie is a familiar figure, and his story motivates me to aspire to have a high level of curiosity. The book uses language that is easy to understand, making it accessible for me to read word by word. The font size, not too large but also not too small, also facilitates my reading. Within the book, it narrates Habibie's life from his childhood, the emphasis his large family placed on education, his education from elementary school to studying in Germany, Habibie's success in creating an airplane, his presidency, and not forgetting his love story with Ainun, which has inspired many. Additionally, the book touches on their love journey, which was adapted into a film. This inspiration extends beyond Indonesia, reaching various countries in Asia and even Europe."
    },
    {
      "title": "BJ HABIBIE, THE POWER OF IDEAS",
      "author": "A. Makmur Makka",
      "genre": "Biography",
      "synopsis": "This book contains a collection of ideas, thoughts, and insights from BJ Habibie regarding God, lifestyle, technology, leadership, religion, human resources (HR), Islam, Indonesian identity, industrialization, added value, development strategy, governance system, and Pancasila. It discusses concepts related to the envisioned development of a nation and the conception of humans as God's most noble creation that should not be wasted. In this context, BJ Habibie consistently emphasizes the need for added value for every individual, as the entire process of economy and new discoveries involves value addition. Material added value also occurs in individuals through education, resulting in personal added value. Personal values enable individuals to have a high mentality, thinking ability, analytical skills, policy-making skills, and foster new innovations. BJ Habibie's ideas as a scientist, technocrat, and statesman have inspired society and the nation, demonstrating The Power of Ideas. According to him, technology should not burden society but must improve the quality of life and productivity. Therefore, technology should be adapted to local socio-economic and cultural conditions. In relation to Islam and the Indonesian Muslim Intellectual Association (ICMI), he hopes that ICMI can efficiently and effectively catalyze the continuous added value process for the development of the entire Indonesian nation in the context of practicing Pancasila and the 1945 Constitution. The industrialization process in Indonesia extends beyond manufacturing to include agriculture, plantations, forestry, and services. However, aside from manufacturing, most other industries cannot absorb employment as expected. Regarding love, BJ Habibie divides it into five manifestations: first, love for fellow human beings; second, love for the works of humanity; third, love for one's job; fourth, love for nature and one's habitat; and fifth, love for God. In his work, he adheres to rational principles, acts consistently, and applies fairness. Goals, targets, working methods, and operational programs are determined based on objective facts and common sense. Additionally, according to him, life is not about calculations, but life is commitment. Commitment to knowledge, the nation and state, family, work, and colleagues. His five mottos are: work hard, be rational, be honest and open, be humble, and never be a hero.Other ideas are reflected in the nation's development strategy through science and technology, Islam, Indonesian identity, industrialization strategy, and governance system. All of these have shaped and enriched the civilization of the nation. It is known that his ideas are not only theoretical and oratorical notes on paper but have been demonstrated and proven."
    },
    {
      "title": "Aksi Massa",
      "author": "Tan Malaka",
      "genre": "History",
      "synopsis": "What is intriguing about Tan's numerous thoughts articulated in his books is how he captures realities that are challenging for others to grasp, and even more relevant when juxtaposed with the most current realities. Tan is not only an intellectual (in the true definition) who is intelligent but also well-versed in various disciplines of knowledge. We cannot forget Tan's Madilog, in which he discusses the connection between Atoms and Materialism. I honestly can't imagine how brilliant Tan was in his time. How could there be someone so genius among 55 million uneducated people in a situation of colonization that sought to deceive? One of his books that reflects Tan's genius is Aksi Massa (Mass Action). The book is not thick, only 148 pages. It is light in terms of discussion and may be a bit confusing for readers who rarely read old books. Similar to Pram's books that still use outdated language and appear to be in Malay. Aksi Massa is no exception. However, what makes us want to continue reading this book is its provocative and revolutionary writing style. Indeed, the book is a glimpse into the discussion about calls for revolution and mass action during Dutch colonial rule.This book is crucial for activists and students alike. Perhaps, for activists who often engage in mass actions and demonstrations, they will reflect on their actions after reading this book. Perhaps, the mass actions they carry out in the name of the people are not truly for the people, not for the masses. Instead, in Tan's language, it is referred to as Putch. Let's see if our actions, such as the Kamisan rallies, are part of mass action or more aligned with Putch behavior.According to Tan, Putch is an action by a small clandestine group that moves quietly and is not related to the people or the masses. These Putch groups usually only design according to their own desires and capabilities without considering the feelings and capabilities of the masses.When these Putch groups take action, the masses will not come to their aid. Not because the masses are ignorant and not paying attention to the ongoing situation, but because the masses will only fight for their immediate needs according to their interests, be it economic, political, social, and so on."
    },
    {
      "title": "Sewu Dino",
      "author": "Simpleman",
      "genre": "Horror",
      "synopsis": "It is in this room that you will work. said mbah tamin while opening the door. Instantly, a foul odor wafted up. Sri stood still. In front of her lay a woman, caged in a corpse frame. Her body was thin and pale. Her body was covered in ulcers and pus. Not only that, her stomach was also large like a pregnant person. Not caring about the frightened sri, mbak tamin continued her explanation, she is dela atmojo, a child you must take care of until her time comes. She was sent by the curse of santet sewu dino. Santet that has claimed the lives of almost all members of the atmojo family!. From the best-selling author of KKN in the village of dancers, Simpleman returns with a tale of Javanese clichés sent to eat away at human lives. The more we think we've found our way out, the more we feel lost. Because this story is bigger than you imagined."
    },
    {
      "title": "Perahu Kertas",
      "author": "Dewi Lestari “Dee",
      "genre": "Fiction - Teenlit",
      "synopsis": "Perahu Kertas tells the story of Kugy, a girl with a fondness for daydreaming and writing fairy tales. She often writes letters to Neptune in the form of paper boats, which she sets adrift on lakes or seas. Kugy's love for the literary world leads her to pursue a literature education at a university in the city of Bandung.Meanwhile, Keenan is a man who enjoys painting. After a stopover in Amsterdam with his grandmother, Keenan finally returns to Indonesia and attends school in Bandung. Keenan initially aspired to become a painter but was compelled to enter the Faculty of Economics due to his father's wishes.Noni, Kugy's childhood friend, introduces her to Keenan. Keenan is Noni's cousin and is also romantically involved with Noni's boyfriend, Eko. The four of them become friends until Kugy and Keenan develop feelings for each other.However, they keep these feelings hidden as Kugy is already in a relationship with a man named Joshua, while Keenan is arranged to marry Noni's cousin, Wanda. The relationship between Kugy and Keenan becomes strained after Keenan starts dating Wanda. Eventually, Keenan faces problems that lead to the end of his relationship with Wanda.Family issues and heartbreak prompt Keenan to leave his life in Bandung. He goes to Bali and meets Pak Wayan, who has a passion for painting. During his stay on the Island of the Gods, Keenan continues to nurture his talent in painting and falls in love with Pak Wayan's niece, Ludhe Laksmi.On the other hand, Kugy works in Jakarta as a copywriter. She meets Remi, her older brother's boss and friend. They fall in love and decide to pursue a relationship. Eventually, Keenan has to return to Jakarta to continue his family's business, bringing Kugy and Keenan back together in the city."
    },
    {
      "title": "Mencapai Indonesia Merdeka",
      "author": "Ir. Soekarno",
      "genre": "History",
      "synopsis": "This book is designed to remind us of the struggle of the Indonesian people in gaining independence. Gaining independence was not an easy matter; the Indonesian people had to endure various significant and anarchic trials. Starting from the cruelty inflicted by the Dutch, famously known as cultuurstelsel (forced cultivation), the Japanese with romusha (forced labor), and the Portuguese with the spice trade monopoly.The book also serves as a reminder for the Indonesian people, who, until now, have not achieved genuine independence. To achieve true independence, the concept of politics often emphasized by Sukarno, namely self-help and non-cooperation/standing on one's own feet (self-reliance), is crucial. Here, the reviewer needs to elaborate on how the concept of self-help and non-cooperation in politics was formed.It all started with the rejection of the thesis Profesor Veth: Indonesia has never been independent, from the Hindu era to the Dutch era. Instead, the Hindu kingdom became the ruler of the Indonesian state and was colonized by the Dutch.At that time, Indonesia was independent, but it was the inhabitants who became the sharpeners of the colonizer's knife, exploiting the common people to pave the way for Early European Capitalism in Asia.To facilitate Early Capitalism, the colonizers manipulated the mindset of the Indonesian people, gradually changing ancient feudalism to a new feudalism. In other words, they destabilized the kingdom from within.After destabilizing the kingdom, the colonizers implemented their activities through violence and cruelty, such as forced cultivation and then escalating to heavier policies like taxing agricultural products such as cloves, nutmeg, and the monopoly right to buy burdensome agricultural products.However, when modern capitalism produced surplus capital, its system was transformed into free competition, automatically opening the gates for investors to invest in Indonesia, a practice that continues to this day, as seen with Freeport.The people of Indonesia were extremely impoverished at that time, with incomes as low as 8 cents. However, it is not impossible that this homeland is rich in resources for the impoverished common people and will never experience prosperity under the colonizer. Therefore, despite being colonized, the people of Indonesia would never be miserable because Indonesia is a land rich in abundance.After gradually indoctrinating the thoughts and energy of the Indonesian people, the sound minds and energies of the Marhaen people began to rediscover themselves. Through the Fajar Menyingsing movement, the Indonesian people rose again.The Fajar Menyingsing movement aimed to achieve significant change. Not through Bojuis, Ningrat, Radicalism, or even Marhaen Reformists. But through the path of radical Marhaen party that knows when to strike its blows (timing).This party would later have a vision and mission: if Indonesia wants to be truly independent, it must break free from the grip of imperialism and capitalism by cutting off its systems, abolishing the systems, and being free from the systems of imperialism and capitalism, thus achieving the golden bridge of independence.With the imperialist and feudal positions serving as references for imperialists to maintain their position, there is only one word: opposition/contradiction with one's own strength, one's own thinking, and one's own power. In political terms, it is to believe in one's own strength (self-help and non-cooperation) and, in Soekarno's words, to be self-reliant (standing on one's own feet).In implementing the politics of self-help and non-cooperation, radicalism is used to subdue imperialism.After subduing imperialism, a new problem arises on the other side: who will lead Indonesia in the future. The leader must be an Egalitarian from the Marhaen class to prevent Nationalism-Feudalism and Nationalism-Bourgeoisie. This would only lead the Marhaen people into the political abyss. Meanwhile, Marhaen proposes a democracy based on mutual cooperation in the form of socio-democracy and socio-Nationalism. This would eliminate capitalism and bourgeoisie.With all this, Marhaen's aspirations for Indonesia to be independent will be realized.This background explains why the concept of self-help and non-cooperation in politics was formed and made it a powerful weapon for the Indonesian people in gaining independence. It becomes the special slogan or foundation that will never be possessed by any other nation.Here, the reviewer will also provide knowledge about self-help politics in other countries, including India and Ireland, intended to enrich the reader's insights.In India, the concept of self-help is embodied in Swadeshi, spearheaded by Mahatma Gandhi. Swadeshi here means boycotting British goods and is a strategy for the struggle for Indian independence, attacking British imperialism. At that time, India was a colony of Britain led by Albion (Prime Minister of Britain) with the concept of its imperialism being Mechanism and Industrialism.In Ireland, the concept of self-help is the Sinn Fein politics pioneered by Arthur Griffith. Sinn Fein here means forgetting the English nation, working as if there is no English nation in the world, and believing in oneself (Ireland). This is meant to separate from England and demand independence from England. Because England and Ireland are actually one region, but since the Irish members in the British Parliament are few, their people arealways oppressed by England."
    },
    {
      "title": "Laskar Pelangi",
      "author": "Andrea Hirata",
      "genre": "Roman",
      "synopsis": "The novel Laskar Pelangi tells the story of the lives of 10 outstanding children who have a high fighting spirit to continue their education in the village of Gantung, Bangka Belitung Islands.These ten children are named Laskar Pelangi, consisting of Ikal, Lintang, Mahar Ahlan, Sahara Aulia Fadillah, Syahdan Noor Aziz, Samson or Borek, Muhammad Jundullah Gufron Nur Zaman or A Kiong, Harun Ardhili Ramadhan, Trapani Ihsan Jamari, and Mukharam Kudai Khairani. These ten children attend a school named SD Muhammadiyah Gantung, guided by Bu Muslimah and Pak Harfan.While they attend school, they also gain a new friend, Flo, a transfer student from SD PN Timah. Most of the ten children attending SD Muhammadiyah Gantung are children of tin miners on the island with the largest natural tin wealth in the world. However, this contrasts with the standard of living of the local community.The story begins with the acceptance of new students at SD Muhammadiyah Gantung, where only 9 people apply for school. This worries Bu Muslimah, Pak Harfan, and all the parents because the local government will announce that an elementary school must have a minimum of 10 students for school activities to continue. Since the awaited 10th student does not appear, Pak Harfan has to make the most difficult decision in disappointment.Finally, in the midst of this situation, a new student arrives to save the day. The student's name is Harun Ardhli Ramadhan, a child with mental disabilities but with a high fighting spirit to go to school. The camaraderie between students and teachers finally begins from that moment.Throughout their education, Bu Muslimah and Pak Harfan guide and teach them with enthusiasm and high dedication. The students also learn with great enthusiasm thanks to the unity and spirit they all possess. Eventually, Bu Muslimah dubbed them Laskar Pelangi (Rainbow Troops). Besides Bu Muslimah and Pak Harfan, SD Muhammadiyah Gantung also has a teacher who doubles as a school principal named Pak Harfan Effendi Noor.Similar to the other two teachers, Pak Harfan teaches with great enthusiasm. He often incorporates exemplary stories of prophets and messengers while teaching.In the midst of their limitations, the members of Laskar Pelangi have to face various obstacles to successfully achieve all their dreams. The journey of these characters will be colored with various emotional experiences, both joyous and poignant."
    },
    {
      "title": "Antares",
      "author": "Rweinda",
      "genre": "Fiction - Teenlit",
      "synopsis": "This novel tells the story of two characters, Antares Sebastian Aldevaro (Antares) and Zeanne Queensha Bratadikara (Zea). Zea is a transfer student at Antares' school. The two of them then meet and accidentally become close. Antares is known as a delinquent student who likes to cause trouble at school. He is also the leader of a motorcycle gang called Calderioz. But behind his fierce behavior, Antares has a handsome face and is described as God-like in Greek mythology. Zea, who is a transfer student from Bandung, has a secret and a special mission from her transfer to Derlangga High School. Zea is experiencing personal problems and she wants to find the perpetrator at Derlangga High School. Unexpectedly, Zea turns out to be the younger brother of the head of the Wolves motorcycle gang, which has a problem with the Calderioz gang. When Antares found out about Zea's involvement with the Wolves gang, he tried to stay away and avoid Zea. He did this because of the growing feelings between them. It was later discovered that someone was pitting Antares and Zea against each other to further inflame Calderioz and the Wolves. This figure also tried to harm them. Finally, Antares, Zea, and Calderioz gang members made a plan to expose the perpetrator behind all this."
    },
    {
      "title": "Habis Gelap Terbitlah Terang",
      "author": "R.A. Kartini",
      "genre": "Biography",
      "synopsis": "This book is a collection of correspondence between Raden Ajeng Kartini and her friends in the Netherlands. After the passing of R.A. Kartini, these letters were compiled by Mr. J. H. Abendanon and published. The contents of these letters revolve around her aspirations to advance women, her hopes, and her life journey. They serve as evidence of Kartini's strong desire to liberate women from deeply ingrained discrimination.Kartini wished that, as a woman, she and her fellow women would be treated equally to their male counterparts, like brothers or friends. Kartini had to grapple with customary cultural issues in her local region, where women were not allowed to determine and realize their own desires, but rather had to follow their parents' wishes. This made Kartini envious and question why women were hindered from obtaining higher education while men were not. She aspired to receive a high-level education, similar to her second brother, RMP Sosrokartono, who excelled in his studies at TU Delft in the Netherlands and mastered 26 languages.Admiring her brother and aspiring to study in the Netherlands, Kartini encountered obstacles. This led her to criticize these issues through correspondence with individuals in the Netherlands, including Estella H. Zeehandelaar, J.H. Abendanon and his wife (Rosa Abendanon), as well as Prof. Anton.This book has inspired the progress of Indonesian women throughout the generations, proving its content to be still highly relevant from one generation to the next."
    },
    {
      "title": "Dia Adalah Dilanku Tahun 1990",
      "author": "Dewi Lestari “Dee”",
      "genre": "Romance",
      "synopsis": "Love, even though it has been a long time, still remains sweet when remembered.Milea, she goes back to the year 1990 to tell the story of a man who once was someone she deeply loved, Dilan. The man who approached her (Milea) not with a bouquet of flowers or sweet words to capture her attention.Instead, through a prediction as depicted in the following excerpt:I predict, later we will meet at the canteen. – Dilan - page 20 Unfortunately, his prediction was wrong. That day, Milea did not go to the canteen because she had to discuss class matters with her friends. A simple yet charming way chosen by Dilan to once again capture Milea's attention. He sent Piyan to deliver his letter, which read:Milea, my prediction, we will meet at the canteen. Turns out, it was wrong. I'm sorry, but I want to predict again: tomorrow we will meet. – Dilan – page 22 Wait, the tomorrow that Dilan meant was Sunday. It couldn't be, could they meet? However, it turns out his prediction this time was correct. Dilan came to Milea's house to deliver his invitation letter which stated:In the name of Allah, the Most Gracious and Most Merciful. With this, with full of feelings, inviting Milea Adnan to school on:Monday, Tuesday, Wednesday, Thursday, Friday, and Saturday. – Dilan – page 27 These simple things turned out to make Milea smile and slowly begin to pay attention to Dilan. To the point where she momentarily forgot about Beni, her boyfriend who was in Jakarta. Milea didn't want to lose Dilan. For her, Dilan was like something that always made her days colorful. But, she appeared very wicked to Dilan because she was willing to accept attention from Dilan, even though she already had someone. Until the time Milea decided to end her relationship with Beni, her boyfriend in Jakarta. He was a guy who was very emotional and spoiled. Because of something that doesn't need to be explained. Since then, the relationship between Dilan and Milea became even closer."
    },
    {
      "title": "Gadis Kretek",
      "author": "Ratih Kumala",
      "genre": "Fiction",
      "synopsis":"The novel Gadis Kretek is still in the spotlight on social media. Apparently, many people are not yet familiar with this domestic novel. Ratih Kumala is the figure behind the novel Gadis Kretek. She is an Indonesian literary writer. Gadis Kretek was first published in 2012. With 274 pages of carefully crafted words, Ratih Kumala successfully provides captivating insights and stories about the role of women in the novel Gadis Kretek. It's worth noting that Gadis Kretek won the Kusala Sastra Khatulistiwa award in 2012. Interestingly, Gadis Kretek uses more narration than dialogue to depict Javanese culture, especially regarding the clove cigarette industry in the early days of Indonesia's establishment. Now, curious about the synopsis of the novel Gadis Kretek? Let's check it out below. On his deathbed, Soeraja mentions a name that forces his three children, Tager, Karim, and Lebas, to explore the entire city in Central Java to find the figure of Jeng Yah. During the search for Jeng Yah, Soeraja's three children, Tager, Karim, and Lebas, gradually learn about the history of the establishment of their father's clove cigarette factory, Soejagad Raja. It turns out to be a long, competitive, and unexpected history. In their youth, their father, Soejagad, was close friends with Idroes. Both worked at a kretek cigarette company owned by Trisno. However, the Japanese occupation bankrupted the business, leading Trisno to sell all the remaining assets. Seeing an opportunity, Idroes bought the remaining tobacco at a low price and started a business making kretek cigarettes. Not wanting to lose to Idroes, Soejagad eventually established his own kretek cigarette business, making the two friends business competitors. Their competition heated up when Seojagad failed to propose to Roemaisa because he couldn't read. Meanwhile, Idroes successfully married Roemaisa and had two children named Dasiyah and Rukayah. Soejagat himself eventually married Lilis and was blessed with a child named Purwati. In the course of events, Dasiyah grew up as a talented woman in making the best kretek cigarettes. Every day she rolled cigarettes for her father. However, Idroes became puzzled when he noticed that the number of rolled cigarettes by Dasiyah was decreasing. It was eventually revealed that Dasiyah was giving her rolled cigarettes to a young man she loved named Soeraya. The novel Gadis Kretek conveys the struggle of women in a patriarchal and feudal Javanese culture in both business and choosing life partners."
    },
    {
      "title": "Kisah Hidupku Andy Noya",
      "author": "Kolaborasi Robert Adhi Kusumaputra dan Andy F. Noya",
      "genre": "Biography",
      "synopsis":"This book is a biography of Andy F. Noya. Compiled over approximately four years, the book recounts the personal life of Andy F. Noya, from his childhood to his current role as the host of Kick Andy on Metro TV. Little did we know that someone with the full name Andy Wim Flores Noya has many interesting stories from his past. The book covers enjoyable, humorous, and even sad and poignant stories that are clearly written in this book. The narrative style using I in its delivery makes it feel like we are not reading someone else's biography but rather walking through the life story of Andy F. Noya. With splashes of excerpted sentences from each sub-chapter presented with blue pages, it ignites the reader's curiosity to continue reading the next stories.Andy is a male descendant of Ambon-Dutch-Javanese-Portuguese heritage whose adolescence was spent in Papua. He lived in various cramped places, along with his mother, who worked as a seamstress, and his two sisters. When he graduated from elementary school, he moved to Papua to live with his father, who worked as a typewriter repairman. In his youth, he didn't like wealthy people and despised birthdays. Andy F. Noya also has many humorous stories about his love life. This book thoroughly delves into the unexpected life story of this calm-mannered individual. The ups and downs of his career as a journalist are also narrated in an engaging way. Many unexpected events occurred in the life journey of this man who is now the father of three children. It's no wonder that this book became a Best Seller in 2015."
    },
    {
      "title": "Dear Nathan",
      "author": "Erisca Febriani",
      "genre": "Romance",
      "synopsis":"The novel Dear Nathan tells the story of a student from Bandung named Salma. Salma has just moved to Garuda High School. On her first day at school, Salma is late for the ceremony because she got stuck in traffic. Salma panics as she is usually a well-behaved student. Later, she meets Nathan, another student at Garuda High School, who is also late. Nathan invites Salma to sneak into the school through a shortcut. After helping Salma, Nathan leaves without introducing himself. One day, Salma encounters Nathan again and they get to know each other. Nathan and Salma have two very different personalities. Nathan is a rebellious child who doesn't understand school rules, while Salma is a student who always follows the rules and has commendable behavior. These differences complement their friendship and bring them closer together. As their friendship grows, feelings of love develop between them. Salma and Nathan eventually enter into a romantic relationship. The relationship between Nathan and Salma is like any other relationship with its ups and downs. They face various challenges, from personal issues arising from Nathan's family problems to people trying to separate them. Despite the challenges, they manage to overcome each problem, going through a rollercoaster of experiences. Nathan's character and attitude gradually change for the better. He becomes a diligent and obedient student. Salma remains gentle and is always willing to be by Nathan's side."
    },
    {
      "title": "Surat Kecil untuk Tuhan",
      "author": "Agnes Davonar",
      "genre": "Religion, Motivation, Inspiration, Non - Fiction",
      "synopsis":"Surat Kecil untuk Tuhan tells the story of a girl named Gita Sesa Wanda Cantika, or Keke, who is a fighter against rhabdomyosarcoma, a type of cancer. She was only 13 years old when diagnosed with this illness. Keke was born into an affluent but broken family. Her parents were divorced, and she had to live with her father and two older brothers. Despite her family situation, Keke excelled both academically and socially. She had many close friends and a loving boyfriend. Unfortunately, her peaceful life took a sudden turn when she was diagnosed with the aggressive cancer known as rhabdomyosarcoma. The disease, initially perceived as just an eye ailment, slowly took away many aspects of Keke's life, including her normal school life and physical appearance. Throughout three years of battling this aggressive cancer, Keke was haunted by the shadow of death. She decided to write a small letter to God, containing various requests, including her desire to recover, grow up, and a plea that no one else would suffer the same fate as hers."
    }
  ]}